app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "fdsgsd"], ["body", "fgddf"], ["user_id", 1], ["created_at", "2020-01-13 05:58:18.834412"], ["updated_at", "2020-01-13 05:58:18.834412"]]
SELECT "books".* FROM "books"
---
	def create
		@book = Book.new(book_params)
		@book.user_id = current_user.id
		if @book.save
			redirect_to book_path(@book.id), notice:"You have creatad book successfully."
	    else
	  	@books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def screen_user
  	book = Book.find(params[:id])