app/controllers/users_controller.rb

  def update
  	@user = User.find(params[:id])
  	if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "vasvdsa"], ["profile_image_id", "f75a400cc2d14573a459ff9b9f25a7b33526bf83c005bf842ffe4dd51a20"], ["updated_at", "2020-01-12 08:43:19.623094"], ["id", 4]]

  def screen_user
	user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]